import { FontAwesomeIcon } from '@fortawesome/react-fontawesome'
import { faX } from '@fortawesome/free-solid-svg-icons'
import "./usda.css"
import logo1 from "../images/geostatpop.31d1e9d6067f4afa850b.png"
import logo2 from "../images/usdapop.4aef2951eb177ab713ea.jpg"


export const USDA = (props) => {
    return(props.trigger) ? (
        <div className="usda_div">
            <FontAwesomeIcon onClick={() => props.setTrigger(false)} className='usdaX_icon' icon={faX} />
            <div className='usda_div_img'>
                <img className='usda_div_img1' src={logo1} alt='logo1' />
                <img className='usda_div_img2' src={logo2} alt='logo2' />
            </div>
            <p className="usda_div_p">
            სოფლის მეურნეობის სტატისტიკის პორტალი შექმნილია აშშ-ს სოფლის მეურნეობის დეპარტამენტის (USDA) ტექნიკური და ფინანსური მხარდაჭერით. <br/>აღნიშნული პორტალის მიზანია სოფლის მეურნეობს სექტორით დაინტერესებული პირებისთვის შესაბამისი სტატისტიკური მონაცემების მიწოდება ალტერნატიული გზით, რომლის დროსაც მომხმარებელს ეძლევა საშუალება, სოფლის მეურნეობის შემცველი სხვადასხვა სტატისტიკური ინფორმაციის (მეცხოველეობა, მემცენარეობა, აკვაკულტურა, სასურსათო ბალანსები, ბიზნეს სექტორი, ეროვნული ანგარიშები, პირდაპირი უცხოური ინვესტიციები და ა.შ.) მიღება „ერთი ფანჯრის“ პრინციპის დაცვით, მონაცემთა თანამედროვე ვიზუალიზაციის გათვალისწინებით. <br />სოფლის მეურნეობის სტატისტიკის პორტალი შედგება 5 ძირითადი განყოფილებისგან:
            </p>
            <ul className='usda_div_ul'>
                <li>
                    <strong>მემცენარეობა</strong>
                    - შეიცავს ინფორმაციას მემცენარეობის კულტურების (მრალავწლოვანი, ერთწლიანი) წარმოების, ნათესი ფართობის, საშუალო მოსავლიანობისა, ფერმის კართან ფასების შესახებ, კულტურებისა და წლების მიხედვით.
                </li>
                <li>
                    <strong>მეცხოველეობა</strong>
                    - შეიცავს ინფორმაციას პირუტყვის, ფრინველის სულადობის, ფუტკრის ოჯახების რაოდენობის, მეცხოველეობის პროდუქციის წარმოების, ნამატისა და დაცემის ფერმის კართან ფასების შესახებ, მეცხოვლეობის მაჩვენებლებისა და წლების მიხედვით.
                </li>
                <li>
                    <strong>აკვაკულტურა</strong>
                    - შეიცავს ინფორმაციას აკვაკულტურით დაკავებულ მეურნეობებში თევზის წარმოების, წყალსატევებში არსებული თევზის, რეალიზებული თევზის წილისა და ფერმის კართან ფასების შესახებ, თევზის ცალკეული სახეობებისა და წლების მიხედვით.
                </li>
                <li>
                    <strong>სასურსათო ბალანსები</strong>
                    - შეიცავს ინფორმაციას ისეთი ცალკეული მნიშვნელოვანი პროდუქტების შესახებ, როგორიცაა:
                    <ol>
                        <li>ხორბალი</li>
                        <li>სიმინდი</li>
                        <li>კარტოფილი</li>
                        <li>ბოსტნეული</li>
                        <li>ხორცი(მათ შორის მსხვილფეხა რქოსანი პირუტყვის, ღორის, თხის და ცხვრის, ფრინველის ხორცი)</li>
                        <li>რძისა და რძის პროდუქტები</li>
                        <li>ყურძენი</li>
                        <li>კვერცხი</li>
                    </ol>
                </li>
            </ul>
            <p className="usda_div_p">სასურსათო ბალანსის განყოფილებაში წარმოდგენილია ინფორმაცია აღნიშნული პროდუქტების რესურსების, მათი გამოყენების, წლიური მოხმარების და თვითუზრუნველყოფის კოეფიციენტის შესახებ. <br />
                <strong>ზოგადი ინფორმაცია</strong>
                - შეიცავს სოფლის მეურნეობის ისეთ სტატისტიკურ ინფორმაციას, რომელიც დაკავშირებულია ბიზნეს სექტორთან, პირდაპირ უცხოურ ინვესტიციებთან, ფასებთან, გენდერთან, ეროვნულ ანგარიშებთან, ხელფასებსა და დასაქმებასთან და ა.შ. 
            </p>
        </div>
    ) : "";
}